ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_dmt0_regs.xml
<module id="HSM_DMT0" HW_revision="" description="HSM DMT0 Registers">
	<register id="TIDR" width="32" page="0" offset="0" internal="0" description="Peripheral ID">
		<bitfield id="MINOR" description="" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="MAJOR" description="" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="RTL" description="" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="MODULE_ID" description="" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="BU" description="" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="SCHEME" description="" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="TIOCP_CFG" width="32" page="0" offset="16" internal="0" description="OCP Control">
		<bitfield id="SOFTRESET" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EMUFREE" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="IDLEMODE" description="" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="IRQ_EOI" width="32" page="0" offset="32" internal="0" description="SW End Of Interrupt">
		<bitfield id="LINE_NUMBER" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="IRQSTATUS_RAW" width="32" page="0" offset="36" internal="0" description="Interrupt Status - Raw">
		<bitfield id="MAT_IT_FLAG" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OVF_IT_FLAG" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TCAR_IT_FLAG" description="" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="IRQSTATUS" width="32" page="0" offset="40" internal="0" description="Interrupt Status">
		<bitfield id="MAT_IT_FLAG" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OVF_IT_FLAG" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TCAR_IT_FLAG" description="" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="IRQSTATUS_SET" width="32" page="0" offset="44" internal="0" description="">
		<bitfield id="MAT_IT_FLAG" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OVF_IT_FLAG" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TCAR_IT_FLAG" description="" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="IRQSTATUS_CLR" width="32" page="0" offset="48" internal="0" description="">
		<bitfield id="MAT_IT_FLAG" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OVF_IT_FLAG" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TCAR_IT_FLAG" description="" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="IRQWAKEEN" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="TCAR_WUP_ENA" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OVF_WUP_ENA" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MAT_WUP_ENA" description="" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="TCLR" width="32" page="0" offset="56" internal="0" description="">
		<bitfield id="ST" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="AR" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PTV" description="" begin="4" end="2" width="3" rwaccess="RW"/>
		<bitfield id="PRE" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CE" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SCPWM" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TCM" description="" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="TRG" description="" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="PT" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CAPT_MODE" description="" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPO_CFG" description="" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="TCRR" width="32" page="0" offset="60" internal="0" description="">
		<bitfield id="TIMER_COUNTER" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TLDR" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="LOAD_VALUE" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TTGR" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="TTRG_VLAUE" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TWPS" width="32" page="0" offset="72" internal="0" description="">
		<bitfield id="W_PEND_TCLR" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="W_PEND_TCRR" description="" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="W_PEND_TLDR" description="" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="W_PEND_TTGR" description="" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="W_PEND_TMAR" description="" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="W_PEND_TPIR" description="" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="W_PEND_TNIR" description="" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="W_PEND_TCVR" description="" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="W_PEND_TOCR" description="" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="W_PEND_TOWR" description="" begin="9" end="9" width="1" rwaccess="R"/>
	</register>
	<register id="TMAR" width="32" page="0" offset="76" internal="0" description="">
		<bitfield id="COMPARE_VLAUE" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TCAR1" width="32" page="0" offset="80" internal="0" description="">
		<bitfield id="CAPTURE_VALUE1" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="TSICR" width="32" page="0" offset="84" internal="0" description="">
		<bitfield id="SFT" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="POSTED" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="READ_MODE" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="READ_AFTER_IDLE" description="" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="TCAR2" width="32" page="0" offset="88" internal="0" description="">
		<bitfield id="CAPTURE_VALUE2" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="TPIR" width="32" page="0" offset="92" internal="0" description="">
		<bitfield id="POSITIVE_INC_VALUE" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TNIR" width="32" page="0" offset="96" internal="0" description="">
		<bitfield id="NEGATIVE_INC_VALUE" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TCVR" width="32" page="0" offset="100" internal="0" description="">
		<bitfield id="COUNTER_VALUE" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TOCR" width="32" page="0" offset="104" internal="0" description="">
		<bitfield id="OVF_COUNTER_VALUE" description="" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="TOWR" width="32" page="0" offset="108" internal="0" description="">
		<bitfield id="OVF_WRAPPING_VALUE" description="" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
</module>
